app/controllers/characters_controller.rb

  def set_upvotes_to_0
    all_characters = Character.all
    all_characters.each do |character|
      character.upvotes = 0
      if character.transformation.nil?

      else
        character.transformation.upvotes = 0
        character.save
---
INSERT INTO "characters" ("action_1_flavor", "action_1_id", "action_1_name", "action_1_rules", "action_2_flavor", "action_2_id", "action_2_name", "action_2_rules", "action_3_flavor", "action_3_id", "action_3_name", "action_3_rules", "action_4_flavor", "action_4_id", "action_4_name", "action_4_rules", "actions", "base_armor", "base_attack", "base_defense", "base_power", "created_at", "creator", "description", "main_image", "max_hp", "max_mp", "name", "summon_attack", "summon_name", "summon_picture", "updated_at", "upvotes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def create

    x = session["warden.user.user.key"]
    y = User.find(x[0])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

    @actions = @action_1_name + ", " + @action_2_name + ", " + @action_3_name + ", " + @action_4_name
    #binding.pry

    if(!Character.find_by_name(@name).nil?)
---
SELECT "characters".* FROM "characters" WHERE "characters"."name" = '5 Stage Test' LIMIT 1

  def index
    nm = params[:name]
  #  #binding.pry
    @character = Character.find_by_name(nm)#
---
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Ragnar the Warrior' LIMIT 1

  def character_select_ai
    #binding.pry
    if params["transformation"].nil?
      @characters = Transformation.all
    else
      #@characters = Transformation.all
      preferences = params["transformation"]
      search_hash = {}
      preferences.each do |key, value|
        if value == "0"
          search_hash[key] = false
        end
      end
      #@characters = Transformation.where(search_hash).order("upvotes DESC")
      @characters = Transformation.where(search_hash).order("created_at DESC")
      #@characters = Hash[@characters.sort_by{|k,v|}, v[:upvotes]]

      #binding.pry
      if @characters.empty?
---
SELECT "transformations".* FROM "transformations" ORDER BY created_at DESC
SELECT COUNT(*) FROM "transformations"

  def select_opponent
    @player1_character = params[:name]
    if params["transformation"].nil?
      @characters = Transformation.all
    else
      #@characters = Transformation.all
      preferences = params["transformation"]
      search_hash = {}
      preferences.each do |key, value|
        if value == "0"
          search_hash[key] = false
        end
      end
      @characters = Transformation.where(search_hash).order("upvotes ASC")
      #binding.pry
      if @characters.empty?
---
SELECT "transformations".* FROM "transformations" ORDER BY created_at DESC
SELECT COUNT(*) FROM "transformations"