app/controllers/comment_controller.rb

	def view
		@character = Character.find_by_name(params[:name])
---
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Ragnar the Warrior' LIMIT 1

	def admin
		if current_user.is_admin
			search_hash = {}
			search_hash[:flag] = true
			@comments = Comment.where(search_hash)
			@all_comments = Comment.all
---
SELECT "comments".* FROM "comments"