app/controllers/game_controller.rb

SELECT "games".* FROM "games" WHERE "games"."game_name" = 'g/YSNbP4wbIXbZxj9u2meA==' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Ragnar the Warrior' LIMIT 1
---
  def show

    #create_hash = {:game_name => "test", :player1 => "testUser1", :player2 => "testUser2", :player1_character => "Alice", :player2_character => "Bob", :player1_message => "Hi!", :player2_message => "Lol this game sucks", :current_turn => 1, :player1_buff => "none", :player1_buff_start => 0, :player2_buff => "Power UP", :player2_buff_start => 1, :player1_debuff => "Poison", :player1_debuff_start => 1, :player2_debuff => "None", :player2_debuff_start => 0, :p1_hp => 50, :p2_hp => 50, :p1_mp => 10, :p2_mp => 5, :game_over => false}
    #Game.create!(create_hash)



    test_game = Game.find_by_game_name(session[:current_game])

    x = session["warden.user.user.key"]
    y = User.find(x[0])
    z = y[0]
    @player_username = z["username"]

    #test_game = Game.find_by_game_name("ad;lkfjad;lkfadf")
    #binding.pry

    if(test_game.nil?)
      redirect_to game_game_not_found_path
    else

      if (test_game.current_turn % 2) == 1
        @p1_turn = true
      else
        @p1_turn = false
      end

      #test_game = Game.find(1)
      @player1 = test_game.player1
      @player2 = test_game.player2
      @p1_character = Character.find_by_name(test_game.player1_character)

SELECT "games".* FROM "games" WHERE "games"."game_name" = 'TaiNrnDjuiVv6Rg0SVXxqQ==' LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Ragnar the Warrior' LIMIT 1
---
  def take_turn
  	#binding.pry
  	test_game = Game.find_by_game_name(session[:current_game])

    if(test_game.nil?)
      redirect_to game_game_not_found_path
    else
    	action_id = params["Action"]
      if(params["Action"].nil?)
        action_id = "1"
      end
      if (test_game.current_turn % 2) == 1
        character_name = test_game.player1_character
      else
        character_name = test_game.player2_character
      end

      character = Character.find_by_name(character_name)

UPDATE "games" SET "player2_debuff" = 'Poison', "player2_debuff_start" = 3, "p1_mp" = 20, "p1_guard" = 'f', "p2_guard" = 'f', "current_turn" = 4, "updated_at" = '2015-01-31 08:55:00.348897' WHERE "games"."id" = 72
---
      test_game.results_message = results_string
      #Transformation Stuff
      test_game.tf_message = Transformation::transformation_handler(test_game)
    	test_game.save

SELECT "games".* FROM "games" WHERE "games"."game_name" = 'TaiNrnDjuiVv6Rg0SVXxqQ==' LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'y' LIMIT 1
---
  def ai_take_turn
 	  test_game = Game.find_by_game_name(session[:current_game])

    #if(test_game.nil?)
    #  test_game = Game.find(1)
    #end
    ai_character = Character.find_by_name(test_game.player2_character)

UPDATE "games" SET "player1_debuff" = 'Defense DOWN', "player1_debuff_start" = 10, "p2_mp" = 60, "p1_guard" = 'f', "p2_guard" = 'f', "current_turn" = 11, "updated_at" = '2015-01-31 09:01:57.530599' WHERE "games"."id" = 72
---
   test_game.flavor_message = flavor_string
   test_game.results_message = results_string
   test_game.tf_message = Transformation::transformation_handler(test_game)
 	 test_game.save

SELECT "games".* FROM "games" WHERE "games"."game_name" = 'xNzahP+shth/aq6Doadzdg==' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Ragnar the Warrior' LIMIT 1
---
 def cpu_reset_game

  #binding.pry

  current_game = Game.find_by_game_name(session[:current_game])

  if(current_game.nil?)
    x = session["warden.user.user.key"]
    y = User.find(x[0])
    z = y[0]
    game_name = z["currentgame"]
    current_game = Game.find_by_game_name(game_name)
    if(current_game.nil?)
      flash[:alert] = "Your game was not found. Your opponent may have left the game. Please start a new one."
 	    redirect_to game_game_not_found_path
    else
      session[:current_game] = current_game
    end
  else
   	character1 = Character.find_by_name(current_game.player1_character)

UPDATE "games" SET "p1_hp" = 90, "p2_hp" = 50, "p1_mp" = 60, "p2_mp" = 100, "current_turn" = 1, "game_over" = 'f', "player1_buff" = 'None', "player1_buff_start" = -50, "player1_debuff" = 'None', "player1_debuff_start" = -50, "player2_buff" = 'None', "player2_buff_start" = -50, "flavor_message" = ' ', "results_message" = ' ', "player1_message" = ' ', "player2_message" = ' ', "player1_last_tf" = ' ', "player2_last_tf" = ' ', "player2_description" = 'Klaus Rodrin is a dangerous and cruel dark mage, known throughout the world for
---
    #REMOVE THIS SOON
    #current_game.player1_debuff = "Poison"
    #current_game.player1_debuff_start = 1
   	current_game.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Ragnar the Warrior' LIMIT 1
---
  def create_ai_game

    #binding.pry

    x = session["warden.user.user.key"]
    y = User.find(x[0])
    z = y[0]

    #binding.pry

    username = z["username"]


    character_choice = params[:name]

    #Get character
    player_character = Character.find_by_name(character_choice)

INSERT INTO "games" ("created_at", "current_turn", "flavor_message", "game_name", "game_over", "p1_guard", "p1_hp", "p1_mp", "p2_guard", "p2_hp", "p2_mp", "player1", "player1_buff", "player1_buff_start", "player1_character", "player1_debuff", "player1_debuff_start", "player1_description", "player1_last_tf", "player1_message", "player1_picture", "player1_stage", "player2", "player2_buff", "player2_buff_start", "player2_character", "player2_debuff", "player2_debuff_start", "player2_description", "player2_last_tf", "player2_message", "player2_picture", "player2_stage", "results_message", "tf_message", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---

    z.currentgame = game_name

    z.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Ragnar the Warrior' LIMIT 1
---
  def create_choose_ai_game
     #binding.pry

    x = session["warden.user.user.key"]
    y = User.find(x[0])
    z = y[0]

    #binding.pry

    username = z["username"]


    character_choice = params[:player1name]

    #Get character
    player_character = Character.find_by_name(character_choice)

INSERT INTO "games" ("created_at", "current_turn", "flavor_message", "game_name", "game_over", "p1_guard", "p1_hp", "p1_mp", "p2_guard", "p2_hp", "p2_mp", "player1", "player1_buff", "player1_buff_start", "player1_character", "player1_debuff", "player1_debuff_start", "player1_description", "player1_last_tf", "player1_message", "player1_picture", "player1_stage", "player2", "player2_buff", "player2_buff_start", "player2_character", "player2_debuff", "player2_debuff_start", "player2_description", "player2_last_tf", "player2_message", "player2_picture", "player2_stage", "results_message", "tf_message", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---

    z.currentgame = game_name

    z.save

SELECT "games".* FROM "games" WHERE "games"."game_name" = 'g/YSNbP4wbIXbZxj9u2meA==' LIMIT 1
DELETE FROM "games" WHERE "games"."id" = 67
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "currentgame" = NULL, "updated_at" = '2015-01-31 04:22:16.166354' WHERE "users"."id" = 1
---
  def destroy_current_game
    #if(params["Action"] == "1" )
      current_game = Game.find_by_game_name(session[:current_game])

      if(current_game.nil?)
        redirect_to game_game_not_found_path
      else
        if current_game.player2 != "AI"
          p2 = current_game.player2
        end
        Game.delete(current_game)
        session[:current_game] = nil
        x = session["warden.user.user.key"]
        y = User.find(x[0])
        z = y[0]
        z.currentgame = nil
        z.save
        if(current_game.player2 != "AI")
          player2 = User.find_by_username(p2)
          player2.currentgame = nil
          player2.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "games".* FROM "games" WHERE "games"."game_name" = 'g/YSNbP4wbIXbZxj9u2meA==' LIMIT 1
---
 def rules
    x = session["warden.user.user.key"]

    #binding.pry

    if(not x.nil?)
      y = User.find(x[0])
      z = y[0]
      #binding.pry
      game_name = z["currentgame"]
      #binding.pry
      #binding.pry
      if(not game_name.nil?)
        current_game = Game.find_by_game_name(game_name)