app/controllers/game_controller.rb

   end

    if params[:rules].nil?
      valid_characters = Transformation.all
---
SELECT "transformations".* FROM "transformations"