app/controllers/transformation_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."name" = 'Klaus Rodrin' LIMIT 1
---
	def set_tf_creator_to_character_creator
		tfs = Transformation.all
  		tfs.each do |tf|
  			character = Character.find_by_name(tf.character_name)

SELECT "transformations".* FROM "transformations" WHERE "transformations"."character_name" = 'Klaus Rodrin' LIMIT 1
---
	def edit
		@character_name = params["character_name"]
		@transformation = Transformation.find_by_character_name(@character_name)

INSERT INTO "transformations" ("character_id", "character_name", "created_at", "is_F2M", "is_M2F", "is_adult", "is_age_pro", "is_age_reg", "is_animal", "is_bdsm", "is_bimbo", "is_bizarre", "is_completed", "is_fantasy", "is_full_picture", "is_furry", "is_futa", "is_growth", "is_inanimate", "is_mind", "is_monster_girl", "is_pregnant", "is_race_change", "is_robot", "is_shrink", "is_weight_gain", "stage10_character_description", "stage10_tf_description", "stage10_tf_picture", "stage1_character_description", "stage1_tf_description", "stage1_tf_picture", "stage2_character_description", "stage2_tf_description", "stage2_tf_picture", "stage3_character_description", "stage3_tf_description", "stage3_tf_picture", "stage4_character_description", "stage4_tf_description", "stage4_tf_picture", "stage5_character_description", "stage5_tf_description", "stage5_tf_picture", "stage6_character_description", "stage6_tf_description", "stage6_tf_picture", "stage7_character_description", "stage7_tf_description", "stage7_tf_picture", "stage8_character_description", "stage8_tf_description", "stage8_tf_picture", "stage9_character_description", "stage9_tf_description", "stage9_tf_picture", "updated_at", "upvotes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "transformations" SET "character_id" = 33, "updated_at" = '2015-01-31 09:18:14.238978' WHERE "transformations"."id" = 40
---
				flash[:error] = "ERROR: The Character Your Adding Transformations to Could Not Be Found. "
				redirect_to tf_path(:character_name => character_name)
			else
				tf = Transformation.create!(create_hash)
				current_character.transformation = tf
				current_character.save

SELECT "transformations".* FROM "transformations" WHERE "transformations"."character_name" = 'Klaus Rodrin' LIMIT 1
UPDATE "transformations" SET "is_completed" = 't', "is_full_picture" = 't', "updated_at" = '2015-01-31 09:18:29.901300' WHERE "transformations"."id" = 11
---
				flash[:error] = "ERROR: The Character Your Adding Transformations to Could Not Be Found. "
				redirect_to transformation_edit_path(:character_name => character_name)
			else
				tf = Transformation.find_by_character_name(character_name)
				if tf.nil?
					tf = Transformation.create!(create_hash)
				else
					tf.update_attributes(create_hash)