app/controllers/users_controller.rb

  def view

    x = session["warden.user.user.key"]
    y = User.find(x[0])
    z = y[0]
    @current_username = z["username"]

    if params["current"] == "true"
      @username = @current_username
    else
      @username = params["name"]
    end

    @username = @current_username

    @characters = Character.where(:creator => @username)
    @characters = @characters.order('created_at ASC')
    #binding.pry
    if @characters.nil?
      @characters = []
    end

    if !(@characters.respond_to?('each'))
      x = @characters
      @characters = [x]
    end

    @reports = Report.where(:reporter => @current_username)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "characters".* FROM "characters" WHERE "characters"."creator" = 'User1'
SELECT "reports".* FROM "reports" WHERE "reports"."reporter" = 'User1'